{"backend": "tensorflow", "class_name": "Model", "config": {"layers": [{"inbound_nodes": [], "class_name": "InputLayer", "config": {"batch_input_shape": [null, 299, 299, 3], "sparse": false, "name": "input_6", "dtype": "float32"}, "name": "input_6"}, {"inbound_nodes": [[["input_6", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2], "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "conv2d_471", "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "use_bias": false, "dilation_rate": [1, 1], "kernel_size": [3, 3], "filters": 32, "padding": "valid"}, "name": "conv2d_471"}, {"inbound_nodes": [[["conv2d_471", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_471", "momentum": 0.99, "center": true}, "name": "batch_normalization_471"}, {"inbound_nodes": [[["batch_normalization_471", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "name": "activation_471", "trainable": true}, "name": "activation_471"}, {"inbound_nodes": [[["activation_471", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "conv2d_472", "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "use_bias": false, "dilation_rate": [1, 1], "kernel_size": [3, 3], "filters": 32, "padding": "valid"}, "name": "conv2d_472"}, {"inbound_nodes": [[["conv2d_472", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_472", "momentum": 0.99, "center": true}, "name": "batch_normalization_472"}, {"inbound_nodes": [[["batch_normalization_472", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "name": "activation_472", "trainable": true}, "name": "activation_472"}, {"inbound_nodes": [[["activation_472", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "conv2d_473", "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "use_bias": false, "dilation_rate": [1, 1], "kernel_size": [3, 3], "filters": 64, "padding": "same"}, "name": "conv2d_473"}, {"inbound_nodes": [[["conv2d_473", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_473", "momentum": 0.99, "center": true}, "name": "batch_normalization_473"}, {"inbound_nodes": [[["batch_normalization_473", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "name": "activation_473", "trainable": true}, "name": "activation_473"}, {"inbound_nodes": [[["activation_473", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d_21", "pool_size": [3, 3], "trainable": true, "strides": [2, 2], "padding": "valid"}, "name": "max_pooling2d_21"}, {"inbound_nodes": [[["max_pooling2d_21", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "conv2d_474", "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "use_bias": false, "dilation_rate": [1, 1], "kernel_size": [1, 1], "filters": 80, "padding": "valid"}, "name": "conv2d_474"}, {"inbound_nodes": [[["conv2d_474", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_474", "momentum": 0.99, "center": true}, "name": "batch_normalization_474"}, {"inbound_nodes": [[["batch_normalization_474", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "name": "activation_474", "trainable": true}, "name": "activation_474"}, {"inbound_nodes": [[["activation_474", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "conv2d_475", "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "use_bias": false, "dilation_rate": [1, 1], "kernel_size": [3, 3], "filters": 192, "padding": "valid"}, "name": "conv2d_475"}, {"inbound_nodes": [[["conv2d_475", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_475", "momentum": 0.99, "center": true}, "name": "batch_normalization_475"}, {"inbound_nodes": [[["batch_normalization_475", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "name": "activation_475", "trainable": true}, "name": "activation_475"}, {"inbound_nodes": [[["activation_475", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d_22", "pool_size": [3, 3], "trainable": true, "strides": [2, 2], "padding": "valid"}, "name": "max_pooling2d_22"}, {"inbound_nodes": [[["max_pooling2d_22", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "conv2d_479", "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "use_bias": false, "dilation_rate": [1, 1], "kernel_size": [1, 1], "filters": 64, "padding": "same"}, "name": "conv2d_479"}, {"inbound_nodes": [[["conv2d_479", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_479", "momentum": 0.99, "center": true}, "name": "batch_normalization_479"}, {"inbound_nodes": [[["batch_normalization_479", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "name": "activation_479", "trainable": true}, "name": "activation_479"}, {"inbound_nodes": [[["max_pooling2d_22", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "conv2d_477", "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "use_bias": false, "dilation_rate": [1, 1], "kernel_size": [1, 1], "filters": 48, "padding": "same"}, "name": "conv2d_477"}, {"inbound_nodes": [[["activation_479", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "conv2d_480", "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "use_bias": false, "dilation_rate": [1, 1], "kernel_size": [3, 3], "filters": 96, "padding": "same"}, "name": "conv2d_480"}, {"inbound_nodes": [[["conv2d_477", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_477", "momentum": 0.99, "center": true}, "name": "batch_normalization_477"}, {"inbound_nodes": [[["conv2d_480", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_480", "momentum": 0.99, "center": true}, "name": "batch_normalization_480"}, {"inbound_nodes": [[["batch_normalization_477", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "name": "activation_477", "trainable": true}, "name": "activation_477"}, {"inbound_nodes": [[["batch_normalization_480", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "name": "activation_480", "trainable": true}, "name": "activation_480"}, {"inbound_nodes": [[["max_pooling2d_22", 0, 0, {}]]], "class_name": "AveragePooling2D", "config": {"data_format": "channels_last", "name": "average_pooling2d_46", "pool_size": [3, 3], "trainable": true, "strides": [1, 1], "padding": "same"}, "name": "average_pooling2d_46"}, {"inbound_nodes": [[["max_pooling2d_22", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "conv2d_476", "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "use_bias": false, "dilation_rate": [1, 1], "kernel_size": [1, 1], "filters": 64, "padding": "same"}, "name": "conv2d_476"}, {"inbound_nodes": [[["activation_477", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "conv2d_478", "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "use_bias": false, "dilation_rate": [1, 1], "kernel_size": [5, 5], "filters": 64, "padding": "same"}, "name": "conv2d_478"}, {"inbound_nodes": [[["activation_480", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "conv2d_481", "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "use_bias": false, "dilation_rate": [1, 1], "kernel_size": [3, 3], "filters": 96, "padding": "same"}, "name": "conv2d_481"}, {"inbound_nodes": [[["average_pooling2d_46", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "conv2d_482", "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "use_bias": false, "dilation_rate": [1, 1], "kernel_size": [1, 1], "filters": 32, "padding": "same"}, "name": "conv2d_482"}, {"inbound_nodes": [[["conv2d_476", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_476", "momentum": 0.99, "center": true}, "name": "batch_normalization_476"}, {"inbound_nodes": [[["conv2d_478", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_478", "momentum": 0.99, "center": true}, "name": "batch_normalization_478"}, {"inbound_nodes": [[["conv2d_481", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_481", "momentum": 0.99, "center": true}, "name": "batch_normalization_481"}, {"inbound_nodes": [[["conv2d_482", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_482", "momentum": 0.99, "center": true}, "name": "batch_normalization_482"}, {"inbound_nodes": [[["batch_normalization_476", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "name": "activation_476", "trainable": true}, "name": "activation_476"}, {"inbound_nodes": [[["batch_normalization_478", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "name": "activation_478", "trainable": true}, "name": "activation_478"}, {"inbound_nodes": [[["batch_normalization_481", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "name": "activation_481", "trainable": true}, "name": "activation_481"}, {"inbound_nodes": [[["batch_normalization_482", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "name": "activation_482", "trainable": true}, "name": "activation_482"}, {"inbound_nodes": [[["activation_476", 0, 0, {}], ["activation_478", 0, 0, {}], ["activation_481", 0, 0, {}], ["activation_482", 0, 0, {}]]], "class_name": "Concatenate", "config": {"name": "mixed0", "axis": 3, "trainable": true}, "name": "mixed0"}, {"inbound_nodes": [[["mixed0", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "conv2d_486", "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "use_bias": false, "dilation_rate": [1, 1], "kernel_size": [1, 1], "filters": 64, "padding": "same"}, "name": "conv2d_486"}, {"inbound_nodes": [[["conv2d_486", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_486", "momentum": 0.99, "center": true}, "name": "batch_normalization_486"}, {"inbound_nodes": [[["batch_normalization_486", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "name": "activation_486", "trainable": true}, "name": "activation_486"}, {"inbound_nodes": [[["mixed0", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "conv2d_484", "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "use_bias": false, "dilation_rate": [1, 1], "kernel_size": [1, 1], "filters": 48, "padding": "same"}, "name": "conv2d_484"}, {"inbound_nodes": [[["activation_486", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "conv2d_487", "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "use_bias": false, "dilation_rate": [1, 1], "kernel_size": [3, 3], "filters": 96, "padding": "same"}, "name": "conv2d_487"}, {"inbound_nodes": [[["conv2d_484", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_484", "momentum": 0.99, "center": true}, "name": "batch_normalization_484"}, {"inbound_nodes": [[["conv2d_487", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_487", "momentum": 0.99, "center": true}, "name": "batch_normalization_487"}, {"inbound_nodes": [[["batch_normalization_484", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "name": "activation_484", "trainable": true}, "name": "activation_484"}, {"inbound_nodes": [[["batch_normalization_487", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "name": "activation_487", "trainable": true}, "name": "activation_487"}, {"inbound_nodes": [[["mixed0", 0, 0, {}]]], "class_name": "AveragePooling2D", "config": {"data_format": "channels_last", "name": "average_pooling2d_47", "pool_size": [3, 3], "trainable": true, "strides": [1, 1], "padding": "same"}, "name": "average_pooling2d_47"}, {"inbound_nodes": [[["mixed0", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "conv2d_483", "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "use_bias": false, "dilation_rate": [1, 1], "kernel_size": [1, 1], "filters": 64, "padding": "same"}, "name": "conv2d_483"}, {"inbound_nodes": [[["activation_484", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "conv2d_485", "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "use_bias": false, "dilation_rate": [1, 1], "kernel_size": [5, 5], "filters": 64, "padding": "same"}, "name": "conv2d_485"}, {"inbound_nodes": [[["activation_487", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "conv2d_488", "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "use_bias": false, "dilation_rate": [1, 1], "kernel_size": [3, 3], "filters": 96, "padding": "same"}, "name": "conv2d_488"}, {"inbound_nodes": [[["average_pooling2d_47", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "conv2d_489", "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "use_bias": false, "dilation_rate": [1, 1], "kernel_size": [1, 1], "filters": 64, "padding": "same"}, "name": "conv2d_489"}, {"inbound_nodes": [[["conv2d_483", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_483", "momentum": 0.99, "center": true}, "name": "batch_normalization_483"}, {"inbound_nodes": [[["conv2d_485", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_485", "momentum": 0.99, "center": true}, "name": "batch_normalization_485"}, {"inbound_nodes": [[["conv2d_488", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_488", "momentum": 0.99, "center": true}, "name": "batch_normalization_488"}, {"inbound_nodes": [[["conv2d_489", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_489", "momentum": 0.99, "center": true}, "name": "batch_normalization_489"}, {"inbound_nodes": [[["batch_normalization_483", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "name": "activation_483", "trainable": true}, "name": "activation_483"}, {"inbound_nodes": [[["batch_normalization_485", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "name": "activation_485", "trainable": true}, "name": "activation_485"}, {"inbound_nodes": [[["batch_normalization_488", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "name": "activation_488", "trainable": true}, "name": "activation_488"}, {"inbound_nodes": [[["batch_normalization_489", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "name": "activation_489", "trainable": true}, "name": "activation_489"}, {"inbound_nodes": [[["activation_483", 0, 0, {}], ["activation_485", 0, 0, {}], ["activation_488", 0, 0, {}], ["activation_489", 0, 0, {}]]], "class_name": "Concatenate", "config": {"name": "mixed1", "axis": 3, "trainable": true}, "name": "mixed1"}, {"inbound_nodes": [[["mixed1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "conv2d_493", "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "use_bias": false, "dilation_rate": [1, 1], "kernel_size": [1, 1], "filters": 64, "padding": "same"}, "name": "conv2d_493"}, {"inbound_nodes": [[["conv2d_493", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_493", "momentum": 0.99, "center": true}, "name": "batch_normalization_493"}, {"inbound_nodes": [[["batch_normalization_493", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "name": "activation_493", "trainable": true}, "name": "activation_493"}, {"inbound_nodes": [[["mixed1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "conv2d_491", "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "use_bias": false, "dilation_rate": [1, 1], "kernel_size": [1, 1], "filters": 48, "padding": "same"}, "name": "conv2d_491"}, {"inbound_nodes": [[["activation_493", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "conv2d_494", "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "use_bias": false, "dilation_rate": [1, 1], "kernel_size": [3, 3], "filters": 96, "padding": "same"}, "name": "conv2d_494"}, {"inbound_nodes": [[["conv2d_491", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_491", "momentum": 0.99, "center": true}, "name": "batch_normalization_491"}, {"inbound_nodes": [[["conv2d_494", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_494", "momentum": 0.99, "center": true}, "name": "batch_normalization_494"}, {"inbound_nodes": [[["batch_normalization_491", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "name": "activation_491", "trainable": true}, "name": "activation_491"}, {"inbound_nodes": [[["batch_normalization_494", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "name": "activation_494", "trainable": true}, "name": "activation_494"}, {"inbound_nodes": [[["mixed1", 0, 0, {}]]], "class_name": "AveragePooling2D", "config": {"data_format": "channels_last", "name": "average_pooling2d_48", "pool_size": [3, 3], "trainable": true, "strides": [1, 1], "padding": "same"}, "name": "average_pooling2d_48"}, {"inbound_nodes": [[["mixed1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "conv2d_490", "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "use_bias": false, "dilation_rate": [1, 1], "kernel_size": [1, 1], "filters": 64, "padding": "same"}, "name": "conv2d_490"}, {"inbound_nodes": [[["activation_491", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "conv2d_492", "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "use_bias": false, "dilation_rate": [1, 1], "kernel_size": [5, 5], "filters": 64, "padding": "same"}, "name": "conv2d_492"}, {"inbound_nodes": [[["activation_494", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "conv2d_495", "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "use_bias": false, "dilation_rate": [1, 1], "kernel_size": [3, 3], "filters": 96, "padding": "same"}, "name": "conv2d_495"}, {"inbound_nodes": [[["average_pooling2d_48", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "conv2d_496", "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "use_bias": false, "dilation_rate": [1, 1], "kernel_size": [1, 1], "filters": 64, "padding": "same"}, "name": "conv2d_496"}, {"inbound_nodes": [[["conv2d_490", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_490", "momentum": 0.99, "center": true}, "name": "batch_normalization_490"}, {"inbound_nodes": [[["conv2d_492", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_492", "momentum": 0.99, "center": true}, "name": "batch_normalization_492"}, {"inbound_nodes": [[["conv2d_495", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_495", "momentum": 0.99, "center": true}, "name": "batch_normalization_495"}, {"inbound_nodes": [[["conv2d_496", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_496", "momentum": 0.99, "center": true}, "name": "batch_normalization_496"}, {"inbound_nodes": [[["batch_normalization_490", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "name": "activation_490", "trainable": true}, "name": "activation_490"}, {"inbound_nodes": [[["batch_normalization_492", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "name": "activation_492", "trainable": true}, "name": "activation_492"}, {"inbound_nodes": [[["batch_normalization_495", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "name": "activation_495", "trainable": true}, "name": "activation_495"}, {"inbound_nodes": [[["batch_normalization_496", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "name": "activation_496", "trainable": true}, "name": "activation_496"}, {"inbound_nodes": [[["activation_490", 0, 0, {}], ["activation_492", 0, 0, {}], ["activation_495", 0, 0, {}], ["activation_496", 0, 0, {}]]], "class_name": "Concatenate", "config": {"name": "mixed2", "axis": 3, "trainable": true}, "name": "mixed2"}, {"inbound_nodes": [[["mixed2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "conv2d_498", "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "use_bias": false, "dilation_rate": [1, 1], "kernel_size": [1, 1], "filters": 64, "padding": "same"}, "name": "conv2d_498"}, {"inbound_nodes": [[["conv2d_498", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_498", "momentum": 0.99, "center": true}, "name": "batch_normalization_498"}, {"inbound_nodes": [[["batch_normalization_498", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "name": "activation_498", "trainable": true}, "name": "activation_498"}, {"inbound_nodes": [[["activation_498", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "conv2d_499", "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "use_bias": false, "dilation_rate": [1, 1], "kernel_size": [3, 3], "filters": 96, "padding": "same"}, "name": "conv2d_499"}, {"inbound_nodes": [[["conv2d_499", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_499", "momentum": 0.99, "center": true}, "name": "batch_normalization_499"}, {"inbound_nodes": [[["batch_normalization_499", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "name": "activation_499", "trainable": true}, "name": "activation_499"}, {"inbound_nodes": [[["mixed2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2], "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "conv2d_497", "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "use_bias": false, "dilation_rate": [1, 1], "kernel_size": [3, 3], "filters": 384, "padding": "valid"}, "name": "conv2d_497"}, {"inbound_nodes": [[["activation_499", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2], "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "conv2d_500", "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "use_bias": false, "dilation_rate": [1, 1], "kernel_size": [3, 3], "filters": 96, "padding": "valid"}, "name": "conv2d_500"}, {"inbound_nodes": [[["conv2d_497", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_497", "momentum": 0.99, "center": true}, "name": "batch_normalization_497"}, {"inbound_nodes": [[["conv2d_500", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_500", "momentum": 0.99, "center": true}, "name": "batch_normalization_500"}, {"inbound_nodes": [[["batch_normalization_497", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "name": "activation_497", "trainable": true}, "name": "activation_497"}, {"inbound_nodes": [[["batch_normalization_500", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "name": "activation_500", "trainable": true}, "name": "activation_500"}, {"inbound_nodes": [[["mixed2", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d_23", "pool_size": [3, 3], "trainable": true, "strides": [2, 2], "padding": "valid"}, "name": "max_pooling2d_23"}, {"inbound_nodes": [[["activation_497", 0, 0, {}], ["activation_500", 0, 0, {}], ["max_pooling2d_23", 0, 0, {}]]], "class_name": "Concatenate", "config": {"name": "mixed3", "axis": 3, "trainable": true}, "name": "mixed3"}, {"inbound_nodes": [[["mixed3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "conv2d_505", "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "use_bias": false, "dilation_rate": [1, 1], "kernel_size": [1, 1], "filters": 128, "padding": "same"}, "name": "conv2d_505"}, {"inbound_nodes": [[["conv2d_505", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_505", "momentum": 0.99, "center": true}, "name": "batch_normalization_505"}, {"inbound_nodes": [[["batch_normalization_505", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "name": "activation_505", "trainable": true}, "name": "activation_505"}, {"inbound_nodes": [[["activation_505", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "conv2d_506", "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "use_bias": false, "dilation_rate": [1, 1], "kernel_size": [7, 1], "filters": 128, "padding": "same"}, "name": "conv2d_506"}, {"inbound_nodes": [[["conv2d_506", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_506", "momentum": 0.99, "center": true}, "name": 