{"keras_version": "2.0.8", "class_name": "Model", "backend": "tensorflow", "config": {"input_layers": [["input_2", 0, 0]], "output_layers": [["sequential_2", 1, 0]], "name": "model_2", "layers": [{"class_name": "InputLayer", "name": "input_2", "inbound_nodes": [], "config": {"name": "input_2", "batch_input_shape": [null, 299, 299, 3], "dtype": "float32", "sparse": false}}, {"class_name": "Conv2D", "name": "conv2d_95", "inbound_nodes": [[["input_2", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": false, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "conv2d_95", "trainable": true, "dilation_rate": [1, 1], "filters": 32, "padding": "valid", "activity_regularizer": null, "strides": [2, 2], "bias_constraint": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_95", "inbound_nodes": [[["conv2d_95", 0, 0, {}]]], "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_95", "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null}}, {"class_name": "Activation", "name": "activation_95", "inbound_nodes": [[["batch_normalization_95", 0, 0, {}]]], "config": {"name": "activation_95", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_96", "inbound_nodes": [[["activation_95", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": false, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "conv2d_96", "trainable": true, "dilation_rate": [1, 1], "filters": 32, "padding": "valid", "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_96", "inbound_nodes": [[["conv2d_96", 0, 0, {}]]], "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_96", "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null}}, {"class_name": "Activation", "name": "activation_96", "inbound_nodes": [[["batch_normalization_96", 0, 0, {}]]], "config": {"name": "activation_96", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_97", "inbound_nodes": [[["activation_96", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": false, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "conv2d_97", "trainable": true, "dilation_rate": [1, 1], "filters": 64, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_97", "inbound_nodes": [[["conv2d_97", 0, 0, {}]]], "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_97", "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null}}, {"class_name": "Activation", "name": "activation_97", "inbound_nodes": [[["batch_normalization_97", 0, 0, {}]]], "config": {"name": "activation_97", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_5", "inbound_nodes": [[["activation_97", 0, 0, {}]]], "config": {"name": "max_pooling2d_5", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "name": "conv2d_98", "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": false, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "conv2d_98", "trainable": true, "dilation_rate": [1, 1], "filters": 80, "padding": "valid", "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_98", "inbound_nodes": [[["conv2d_98", 0, 0, {}]]], "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_98", "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null}}, {"class_name": "Activation", "name": "activation_98", "inbound_nodes": [[["batch_normalization_98", 0, 0, {}]]], "config": {"name": "activation_98", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_99", "inbound_nodes": [[["activation_98", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": false, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "conv2d_99", "trainable": true, "dilation_rate": [1, 1], "filters": 192, "padding": "valid", "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_99", "inbound_nodes": [[["conv2d_99", 0, 0, {}]]], "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_99", "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null}}, {"class_name": "Activation", "name": "activation_99", "inbound_nodes": [[["batch_normalization_99", 0, 0, {}]]], "config": {"name": "activation_99", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_6", "inbound_nodes": [[["activation_99", 0, 0, {}]]], "config": {"name": "max_pooling2d_6", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "name": "conv2d_103", "inbound_nodes": [[["max_pooling2d_6", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": false, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "conv2d_103", "trainable": true, "dilation_rate": [1, 1], "filters": 64, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_103", "inbound_nodes": [[["conv2d_103", 0, 0, {}]]], "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_103", "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null}}, {"class_name": "Activation", "name": "activation_103", "inbound_nodes": [[["batch_normalization_103", 0, 0, {}]]], "config": {"name": "activation_103", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_101", "inbound_nodes": [[["max_pooling2d_6", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": false, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "conv2d_101", "trainable": true, "dilation_rate": [1, 1], "filters": 48, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null}}, {"class_name": "Conv2D", "name": "conv2d_104", "inbound_nodes": [[["activation_103", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": false, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "conv2d_104", "trainable": true, "dilation_rate": [1, 1], "filters": 96, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_101", "inbound_nodes": [[["conv2d_101", 0, 0, {}]]], "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_101", "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_104", "inbound_nodes": [[["conv2d_104", 0, 0, {}]]], "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_104", "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null}}, {"class_name": "Activation", "name": "activation_101", "inbound_nodes": [[["batch_normalization_101", 0, 0, {}]]], "config": {"name": "activation_101", "trainable": true, "activation": "relu"}}, {"class_name": "Activation", "name": "activation_104", "inbound_nodes": [[["batch_normalization_104", 0, 0, {}]]], "config": {"name": "activation_104", "trainable": true, "activation": "relu"}}, {"class_name": "AveragePooling2D", "name": "average_pooling2d_10", "inbound_nodes": [[["max_pooling2d_6", 0, 0, {}]]], "config": {"name": "average_pooling2d_10", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "name": "conv2d_100", "inbound_nodes": [[["max_pooling2d_6", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": false, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "conv2d_100", "trainable": true, "dilation_rate": [1, 1], "filters": 64, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null}}, {"class_name": "Conv2D", "name": "conv2d_102", "inbound_nodes": [[["activation_101", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": false, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [5, 5], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "conv2d_102", "trainable": true, "dilation_rate": [1, 1], "filters": 64, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null}}, {"class_name": "Conv2D", "name": "conv2d_105", "inbound_nodes": [[["activation_104", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": false, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "conv2d_105", "trainable": true, "dilation_rate": [1, 1], "filters": 96, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null}}, {"class_name": "Conv2D", "name": "conv2d_106", "inbound_nodes": [[["average_pooling2d_10", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": false, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "conv2d_106", "trainable": true, "dilation_rate": [1, 1], "filters": 32, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_100", "inbound_nodes": [[["conv2d_100", 0, 0, {}]]], "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_100", "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_102", "inbound_nodes": [[["conv2d_102", 0, 0, {}]]], "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_102", "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_105", "inbound_nodes": [[["conv2d_105", 0, 0, {}]]], "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_105", "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_106", "inbound_nodes": [[["conv2d_106", 0, 0, {}]]], "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_106", "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null}}, {"class_name": "Activation", "name": "activation_100", "inbound_nodes": [[["batch_normalization_100", 0, 0, {}]]], "config": {"name": "activation_100", "trainable": true, "activation": "relu"}}, {"class_name": "Activation", "name": "activation_102", "inbound_nodes": [[["batch_normalization_102", 0, 0, {}]]], "config": {"name": "activation_102", "trainable": true, "activation": "relu"}}, {"class_name": "Activation", "name": "activation_105", "inbound_nodes": [[["batch_normalization_105", 0, 0, {}]]], "config": {"name": "activation_105", "trainable": true, "activation": "relu"}}, {"class_name": "Activation", "name": "activation_106", "inbound_nodes": [[["batch_normalization_106", 0, 0, {}]]], "config": {"name": "activation_106", "trainable": true, "activation": "relu"}}, {"class_name": "Concatenate", "name": "mixed0", "inbound_nodes": [[["activation_100", 0, 0, {}], ["activation_102", 0, 0, {}], ["activation_105", 0, 0, {}], ["activation_106", 0, 0, {}]]], "config": {"name": "mixed0", "trainable": true, "axis": 3}}, {"class_name": "Conv2D", "name": "conv2d_110", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": false, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "conv2d_110", "trainable": true, "dilation_rate": [1, 1], "filters": 64, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_110", "inbound_nodes": [[["conv2d_110", 0, 0, {}]]], "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_110", "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null}}, {"class_name": "Activation", "name": "activation_110", "inbound_nodes": [[["batch_normalization_110", 0, 0, {}]]], "config": {"name": "activation_110", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_108", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": false, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "conv2d_108", "trainable": true, "dilation_rate": [1, 1], "filters": 48, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null}}, {"class_name": "Conv2D", "name": "conv2d_111", "inbound_nodes": [[["activation_110", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": false, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "conv2d_111", "trainable": true, "dilation_rate": [1, 1], "filters": 96, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_108", "inbound_nodes": [[["conv2d_108", 0, 0, {}]]], "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_108", "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_111", "inbound_nodes": [[["conv2d_111", 0, 0, {}]]], "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_111", "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null}}, {"class_name": "Activation", "name": "activation_108", "inbound_nodes": [[["batch_normalization_108", 0, 0, {}]]], "config": {"name": "activation_108", "trainable": true, "activation": "relu"}}, {"class_name": "Activation", "name": "activation_111", "inbound_nodes": [[["batch_normalization_111", 0, 0, {}]]], "config": {"name": "activation_111", "trainable": true, "activation": "relu"}}, {"class_name": "AveragePooling2D", "name": "average_pooling2d_11", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"name": "average_pooling2d_11", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "name": "conv2d_107", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": false, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "conv2d_107", "trainable": true, "dilation_rate": [1, 1], "filters": 64, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null}}, {"class_name": "Conv2D", "name": "conv2d_109", "inbound_nodes": [[["activation_108", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": false, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [5, 5], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "conv2d_109", "trainable": true, "dilation_rate": [1, 1], "filters": 64, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null}}, {"class_name": "Conv2D", "name": "conv2d_112", "inbound_nodes": [[["activation_111", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": false, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "conv2d_112", "trainable": true, "dilation_rate": [1, 1], "filters": 96, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null}}, {"class_name": "Conv2D", "name": "conv2d_113", "inbound_nodes": [[["average_pooling2d_11", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": false, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "conv2d_113", "trainable": true, "dilation_rate": [1, 1], "filters": 64, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_107", "inbound_nodes": [[["conv2d_107", 0, 0, {}]]], "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_107", "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_109", "inbound_nodes": [[["conv2d_109", 0, 0, {}]]], "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_109", "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_112", "inbound_nodes": [[["conv2d_112", 0, 0, {}]]], "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_112", "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_113", "inbound_nodes": [[["conv2d_113", 0, 0, {}]]], "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_113", "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null}}, {"class_name": "Activation", "name": "activation_107", "inbound_nodes": [[["batch_normalization_107", 0, 0, {}]]], "config": {"name": "activation_107", "trainable": true, "activation": "relu"}}, {"class_name": "Activation", "name": "activation_109", "inbound_nodes": [[["batch_normalization_109", 0, 0, {}]]], "config": {"name": "activation_109", "trainable": true, "activation": "relu"}}, {"class_name": "Activation", "name": "activation_112", "inbound_nodes": [[["batch_normalization_112", 0, 0, {}]]], "config": {"name": "activation_112", "trainable": true, "activation": "relu"}}, {"class_name": "Activation", "name": "activation_113", "inbound_nodes": [[["batch_normalization_113", 0, 0, {}]]], "config": {"name": "activation_113", "trainable": true, "activation": "relu"}}, {"class_name": "Concatenate", "name": "mixed1", "inbound_nodes": [[["activation_107", 0, 0, {}], ["activation_109", 0, 0, {}], ["activation_112", 0, 0, {}], ["activation_113", 0, 0, {}]]], "config": {"name": "mixed1", "trainable": true, "axis": 3}}, {"class_name": "Conv2D", "name": "conv2d_117", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": false, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "conv2d_117", "trainable": true, "dilation_rate": [1, 1], "filters": 64, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_117", "inbound_nodes": [[["conv2d_117", 0, 0, {}]]], "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_117", "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null}}, {"class_name": "Activation", "name": "activation_117", "inbound_nodes": [[["batch_normalization_117", 0, 0, {}]]], "config": {"name": "activation_117", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_115", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": false, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "conv2d_115", "trainable": true, "dilation_rate": [1, 1], "filters": 48, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null}}, {"class_name": "Conv2D", "name": "conv2d_118", "inbound_nodes": [[["activation_117", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": false, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "conv2d_118", "trainable": true, "dilation_rate": [1, 1], "filters": 96, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_115", "inbound_nodes": [[["conv2d_115", 0, 0, {}]]], "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_115", "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_118", "inbound_nodes": [[["conv2d_118", 0, 0, {}]]], "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_118", "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null}}, {"class_name": "Activation", "name": "activation_115", "inbound_nodes": [[["batch_normalization_115", 0, 0, {}]]], "config": {"name": "activation_115", "trainable": true, "activation": "relu"}}, {"class_name": "Activation", "name": "activation_118", "inbound_nodes": [[["batch_normalization_118", 0, 0, {}]]], "config": {"name": "activation_118", "trainable": true, "activation": "relu"}}, {"class_name": "AveragePooling2D", "name": "average_pooling2d_12", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"name": "average_pooling2d_12", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "name": "conv2d_114", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": false, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "conv2d_114", "trainable": true, "dilation_rate": [1, 1], "filters": 64, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null}}, {"class_name": "Conv2D", "name": "conv2d_116", "inbound_nodes": [[["activation_115", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": false, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [5, 5], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "conv2d_116", "trainable": true, "dilation_rate": [1, 1], "filters": 64, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null}}, {"class_name": "Conv2D", "name": "conv2d_119", "inbound_nodes": [[["activation_118", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": false, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "conv2d_119", "trainable": true, "dilation_rate": [1, 1], "filters": 96, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null}}, {"class_name": "Conv2D", "name": "conv2d_120", "inbound_nodes": [[["average_pooling2d_12", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": false, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "conv2d_120", "trainable": true, "dilation_rate": [1, 1], "filters": 64, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_114", "inbound_nodes": [[["conv2d_114", 0, 0, {}]]], "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_114", "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_116", "inbound_nodes": [[["conv2d_116", 0, 0, {}]]], "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_116", "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_119", "inbound_nodes": [[["conv2d_119", 0, 0, {}]]], "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_119", "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_120", "inbound_nodes": [[["conv2d_120", 0, 0, {}]]], "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_120", "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null}}, {"class_name": "Activation", "name": "activation_114", "inbound_nodes": [[["batch_normalization_114", 0, 0, {}]]], "config": {"name": "activation_114", "trainable": true, "activation": "relu"}}, {"class_name": "Activation", "name": "activation_116", "inbound_nodes": [[["batch_normalization_116", 0, 0, {}]]], "config": {"name": "activation_116", "trainable": true, "activation": "relu"}}, {"class_name": "Activation", "name": "activation_119", "inbound_nodes": [[["batch_normalization_119", 0, 0, {}]]], "config": {"name": "activation_119", "trainable": true, "activation": "relu"}}, {"class_name": "Activation", "name": "activation_120", "inbound_nodes": [[["batch_normalization_120", 0, 0, {}]]], "config": {"name": "activation_120", "trainable": true, "activation": "relu"}}, {"class_name": "Concatenate", "name": "mixed2", "inbound_nodes": [[["activation_114", 0, 0, {}], ["activation_116", 0, 0, {}], ["activation_119", 0, 0, {}], ["activation_120", 0, 0, {}]]], "config": {"name": "mixed2", "trainable": true, "axis": 3}}, {"class_name": "Conv2D", "name": "conv2d_122", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": false, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "conv2d_122", "trainable": true, "dilation_rate": [1, 1], "filters": 64, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_122", "inbound_nodes": [[["conv2d_122", 0, 0, {}]]], "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_122", "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null}}, {"class_name": "Activation", "name": "activation_122", "inbound_nodes": [[["batch_normalization_122", 0, 0, {}]]], "config": {"name": "activation_122", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_123", "inbound_nodes": [[["activation_122", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": false, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "conv2d_123", "trainable": true, "dilation_rate": [1, 1], "filters": 96, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_123", "inbound_nodes": [[["conv2d_123", 0, 0, {}]]], "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_123", "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null}}, {"class_name": "Activation", "name": "activation_123", "inbound_nodes": [[["batch_normalization_123", 0, 0, {}]]], "config": {"name": "activation_123", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_121", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": false, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "conv2d_121", "trainable": true, "dilation_rate": [1, 1], "filters": 384, "padding": "valid", "activity_regularizer": null, "strides": [2, 2], "bias_constraint": null}}, {"class_name": "Conv2D", "name": "conv2d_124", "inbound_nodes": [[["activation_123", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": false, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "conv2d_124", "trainable": true, "dilation_rate": [1, 1], "filters": 96, "padding": "valid", "activity_regularizer": null, "strides": [2, 2], "bias_constraint": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_121", "inbound_nodes": [[["conv2d_121", 0, 0, {}]]], "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_121", "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_124", "inbound_nodes": [[["conv2d_124", 0, 0, {}]]], "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_124", "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null}}, {"class_name": "Activation", "name": "activation_121", "inbound_nodes": [[["batch_normalization_121", 0, 0, {}]]], "config": {"name": "activation_121", "trainable": true, "activation": "relu"}}, {"class_name": "Activation", "name": "activation_124", "inbound_nodes": [[["batch_normalization_124", 0, 0, {}]]], "config": {"name": "activation_124", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_7", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "config": {"name": "max_pooling2d_7", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "trainable": true, "data_format": "channels_last"}}, {"class_name": "Concatenate", "name": "mixed3", "inbound_nodes": [[["activation_121", 0, 0, {}], ["activation_124", 0, 0, {}], ["max_pooling2d_7", 0, 0, {}]]], "config": {"name": "mixed3", "trainable": true, "axis": 3}}, {"class_name": "Conv2D", "name": "conv2d_129", "inbound_nodes": [[["mixed3", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": false, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "conv2d_129", "trainable": true, "dilation_rate": [1, 1], "filters": 128, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_129", "inbound_nodes": [[["conv2d_129", 0, 0, {}]]], "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_129", "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null}}, {"class_name": "Activation", "name": "activation_129", "inbound_nodes": [[["batch_normalization_129", 0, 0, {}]]], "config": {"name": "activation_129", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_130", "inbound_nodes": [[["activation_129", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": false, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [7, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "conv2d_130", "trainable": true, "dilation_rate": [1, 1], "filters": 128, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_130", "inbound_nodes": [[["conv2d_130", 0, 0, {}]]], "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_130", 